Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_HS_STM32F4xx.h
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2019 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        20. November 2019
 * $Revision:    V1.12
 *
 * Project:      OTG High-Speed Driver Header for ST STM32F4xx
 * -------------------------------------------------------------------------- */

#include <stdint.h>
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "RTE_Components.h"

#include "cmsis_compiler.h"

#include "Driver_USBH.h"
#include "Driver_USBD.h"

#ifdef    RTE_DEVICE_FRAMEWORK_CLASSIC
#include "RTE_Device.h"

// Do basic RTE configuration check
#if    (RTE_USB_OTG_HS == 1)
#if   ((RTE_USB_OTG_HS_HOST == 1) && (RTE_USB_OTG_HS_PHY == 0) && (RTE_OTG_HS_VBUS_PIN == 0))
#error  Configure VBUS Power On/Off pin for USB OTG High-speed in RTE_Device.h!
#endif
#else
#error  Enable USB OTG High-speed in RTE_Device.h!
#endif

// If Framework Classic is used create MX defines from RTE defines

#ifdef RTE_Drivers_USBD1
#define MX_USB_OTG_HS_DEVICE                    1
#endif
#ifdef RTE_Drivers_USBH1
#define MX_USB_OTG_HS_HOST                      1
#endif

#define MX_USB_OTG_HS_GPIO_PIN_(n)              GPIO_PIN_##n
#define MX_USB_OTG_HS_GPIO_PIN(n)               MX_USB_OTG_HS_GPIO_PIN_(n)

#if    (RTE_USB_OTG_HS_PHY == 0)                // Internal Full-speed PHY
#define MX_USB_OTG_HS_INT_FS_PHY               (1U)
#elif  (RTE_USB_OTG_HS_PHY == 1)                // External ULPI High-speed PHY
#define MX_USB_OTG_HS_EXT_HS_PHY               (1U)
#endif

#ifndef MX_USB_OTG_HS_INT_FS_PHY
#define MX_USB_OTG_HS_INT_FS_PHY               (0U)
#endif
#ifndef MX_USB_OTG_HS_EXT_HS_PHY
#define MX_USB_OTG_HS_EXT_HS_PHY               (0U)
#endif


#if     (RTE_USB_OTG_HS_PHY == 1)               // External ULPI High-speed PHY

// Pin USB_OTG_HS_ULPI_DIR : PI11 or PC2
#define MX_USB_OTG_HS_ULPI_DIR_Pin              PI11_PC2
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_AF          GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_Speed       GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_PuPd        GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_DIR_GPIOx            RTE_USB_OTG_HS_ULPI_DIR_PORT
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_Mode        GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_Pin         MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_DIR_PIN)

// Pin USB_OTG_HS_ULPI_CK : PA5
#define MX_USB_OTG_HS_ULPI_CK_Pin               PA5
#define MX_USB_OTG_HS_ULPI_CK_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_CK_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_CK_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_CK_GPIOx             RTE_USB_OTG_HS_ULPI_CK_PORT
#define MX_USB_OTG_HS_ULPI_CK_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_CK_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_CK_PIN)

// Pin USB_OTG_HS_ULPI_NXT : PC3 or PH4
#define MX_USB_OTG_HS_ULPI_NXT_Pin              PC3_PH4
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_AF          GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_Speed       GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_PuPd        GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_NXT_GPIOx            RTE_USB_OTG_HS_ULPI_NXT_PORT
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_Mode        GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_Pin         MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_NXT_PIN)

// Pin USB_OTG_HS_ULPI_D0 : PA3
#define MX_USB_OTG_HS_ULPI_D0_Pin               PA3
#define MX_USB_OTG_HS_ULPI_D0_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D0_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D0_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D0_GPIOx             RTE_USB_OTG_HS_ULPI_D0_PORT
#define MX_USB_OTG_HS_ULPI_D0_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D0_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D0_PIN)

// Pin USB_OTG_HS_ULPI_D3 : PB10
#define MX_USB_OTG_HS_ULPI_D3_Pin               PB10
#define MX_USB_OTG_HS_ULPI_D3_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D3_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D3_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D3_GPIOx             RTE_USB_OTG_HS_ULPI_D3_PORT
#define MX_USB_OTG_HS_ULPI_D3_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D3_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D3_PIN)

// Pin USB_OTG_HS_ULPI_D4 : PB11
#define MX_USB_OTG_HS_ULPI_D4_Pin               PB11
#define MX_USB_OTG_HS_ULPI_D4_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D4_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D4_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D4_GPIOx             RTE_USB_OTG_HS_ULPI_D4_PORT
#define MX_USB_OTG_HS_ULPI_D4_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D4_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D4_PIN)

// Pin USB_OTG_HS_ULPI_D1 : PB0
#define MX_USB_OTG_HS_ULPI_D1_Pin               PB0
#define MX_USB_OTG_HS_ULPI_D1_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D1_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D1_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D1_GPIOx             RTE_USB_OTG_HS_ULPI_D1_PORT
#define MX_USB_OTG_HS_ULPI_D1_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D1_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D1_PIN)

