Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_HS_STM32F4xx.h
// Pin USB_OTG_HS_ULPI_D2 : PB1
#define MX_USB_OTG_HS_ULPI_D2_Pin               PB1
#define MX_USB_OTG_HS_ULPI_D2_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D2_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D2_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D2_GPIOx             RTE_USB_OTG_HS_ULPI_D2_PORT
#define MX_USB_OTG_HS_ULPI_D2_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D2_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D2_PIN)

// Pin USB_OTG_HS_ULPI_STP : PC0
#define MX_USB_OTG_HS_ULPI_STP_Pin              PC0
#define MX_USB_OTG_HS_ULPI_STP_GPIO_AF          GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_STP_GPIO_Speed       GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_STP_GPIO_PuPd        GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_STP_GPIOx            RTE_USB_OTG_HS_ULPI_STP_PORT
#define MX_USB_OTG_HS_ULPI_STP_GPIO_Mode        GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_STP_GPIO_Pin         MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_STP_PIN)

// Pin USB_OTG_HS_ULPI_D7 : PB5
#define MX_USB_OTG_HS_ULPI_D7_Pin               PB5
#define MX_USB_OTG_HS_ULPI_D7_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D7_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D7_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D7_GPIOx             RTE_USB_OTG_HS_ULPI_D7_PORT
#define MX_USB_OTG_HS_ULPI_D7_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D7_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D7_PIN)

// Pin USB_OTG_HS_ULPI_D5 : PB12
#define MX_USB_OTG_HS_ULPI_D5_Pin               PB12
#define MX_USB_OTG_HS_ULPI_D5_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D5_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D5_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D5_GPIOx             RTE_USB_OTG_HS_ULPI_D5_PORT
#define MX_USB_OTG_HS_ULPI_D5_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D5_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D5_PIN)

// Pin USB_OTG_HS_ULPI_D6 : PB13
#define MX_USB_OTG_HS_ULPI_D6_Pin               PB13
#define MX_USB_OTG_HS_ULPI_D6_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D6_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D6_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D6_GPIOx             RTE_USB_OTG_HS_ULPI_D6_PORT
#define MX_USB_OTG_HS_ULPI_D6_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D6_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D6_PIN)

#else                                           // On-chip Full-speed PHY

// Pin USB_OTG_HS_ID : PB12
#define MX_USB_OTG_HS_ID_Pin                    PB12
#define MX_USB_OTG_HS_ID_GPIO_AF                GPIO_AF12_OTG_HS_FS
#define MX_USB_OTG_HS_ID_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_HS_ID_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_HS_ID_GPIOx                  GPIOB
#define MX_USB_OTG_HS_ID_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ID_GPIO_Pin               GPIO_PIN_12

// Pin USB_OTG_HS_DM : PB14
#define MX_USB_OTG_HS_DM_Pin                    PB14
#define MX_USB_OTG_HS_DM_GPIO_AF                GPIO_AF12_OTG_HS_FS
#define MX_USB_OTG_HS_DM_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_HS_DM_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_HS_DM_GPIOx                  GPIOB
#define MX_USB_OTG_HS_DM_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_DM_GPIO_Pin               GPIO_PIN_14

// Pin USB_OTG_HS_DP : PB15
#define MX_USB_OTG_HS_DP_Pin                    PB15
#define MX_USB_OTG_HS_DP_GPIO_AF                GPIO_AF12_OTG_HS_FS
#define MX_USB_OTG_HS_DP_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_HS_DP_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_HS_DP_GPIOx                  GPIOB
#define MX_USB_OTG_HS_DP_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_DP_GPIO_Pin               GPIO_PIN_15

#if    ((RTE_USB_OTG_HS_DEVICE == 1) && (RTE_OTG_HS_VBUS_SENSING_PIN == 1))
// Pin USB_OTG_HS_VBUS : PB13
#define MX_USB_OTG_HS_VBUS_Pin                  PB13
#define MX_USB_OTG_HS_VBUS_GPIO_PuPd            GPIO_NOPULL
#define MX_USB_OTG_HS_VBUS_GPIOx                GPIOB
#define MX_USB_OTG_HS_VBUS_GPIO_Mode            GPIO_MODE_INPUT
#define MX_USB_OTG_HS_VBUS_GPIO_Pin             GPIO_PIN_13
#endif

#endif

#if    ((RTE_USB_OTG_HS_HOST == 1) && (RTE_OTG_HS_VBUS_PIN == 1))
// Pin USB_OTG_HS_VBUS_Power : GPIO pin
#define MX_USB_OTG_HS_VBUS_Power_Pin            1
#define MX_USB_OTG_HS_VBUS_Power_GPIO_PuPd      GPIO_NOPULL
#define MX_USB_OTG_HS_VBUS_Power_GPIOx          RTE_OTG_HS_VBUS_PORT
#define MX_USB_OTG_HS_VBUS_Power_GPIO_Mode      GPIO_MODE_OUTPUT_PP
#define MX_USB_OTG_HS_VBUS_Power_GPIO_Pin       MX_USB_OTG_HS_GPIO_PIN(RTE_OTG_HS_VBUS_BIT)
#ifndef    USB_OTG_HS_VBUS_Power_Pin_Active
#define    USB_OTG_HS_VBUS_Power_Pin_Active     RTE_OTG_HS_VBUS_ACTIVE
#endif
#endif

#if    ((RTE_USB_OTG_HS_HOST == 1) && (RTE_OTG_HS_OC_PIN == 1))
// Pin USB_OTG_HS_Overcurrent : GPIO pin
#define MX_USB_OTG_HS_Overcurrent_Pin           1
#define MX_USB_OTG_HS_Overcurrent_GPIO_PuPd     GPIO_NOPULL
#define MX_USB_OTG_HS_Overcurrent_GPIOx         RTE_OTG_HS_OC_PORT
#define MX_USB_OTG_HS_Overcurrent_GPIO_Mode     GPIO_MODE_INPUT
#define MX_USB_OTG_HS_Overcurrent_GPIO_Pin      MX_USB_OTG_HS_GPIO_PIN(RTE_OTG_HS_OC_BIT)
#ifndef    USB_OTG_HS_Overcurrent_Pin_Active
#define    USB_OTG_HS_Overcurrent_Pin_Active    RTE_OTG_HS_OC_ACTIVE
#endif
#endif

// USB_OTG_HS DMA usage
#ifndef    RTE_OTG_HS_DMA
#define    RTE_OTG_HS_DMA                       0
#endif
#ifndef    USB_OTG_HS_DMA
#define    USB_OTG_HS_DMA                       RTE_OTG_HS_DMA
#endif

#elif  (defined(RTE_DEVICE_FRAMEWORK_CUBE_MX))  // #ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
#include "MX_Device.h"

#define CREATE_MX_SYMBOL(mx_def,ext)            MX_##mx_def##_##ext
#define MX_VAL(mx_def,ext)                      CREATE_MX_SYMBOL(mx_def,ext)

// Do basic CubeMX configuration check
#ifndef MX_USB_OTG_HS
#error  Enable USB_OTG_HS in STM32CubeMX!
#endif

#ifdef  MX_USB_OTG_HS_ULPI_D7_GPIO_Speed        // External ULPI High-speed PHY
#define MX_USB_OTG_HS_EXT_HS_PHY               (1U)
#else                                           // Internal Full-speed PHY
#define MX_USB_OTG_HS_INT_FS_PHY               (1U)
#endif

#ifndef MX_USB_OTG_HS_INT_FS_PHY
#define MX_USB_OTG_HS_INT_FS_PHY               (0U)
#endif
#ifndef MX_USB_OTG_HS_EXT_HS_PHY
#define MX_USB_OTG_HS_EXT_HS_PHY               (0U)
#endif

