Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_HS_STM32F4xx.h
// OTG_HS core interrupt register (OTG_HS_GINTSTS)
#define  OTG_HS_GINTSTS_CMOD                ((uint32_t)    1U       )
#define  OTG_HS_GINTSTS_MMIS                ((uint32_t)    1U  <<  1)
#define  OTG_HS_GINTSTS_OTGINT              ((uint32_t)    1U  <<  2)
#define  OTG_HS_GINTSTS_SOF                 ((uint32_t)    1U  <<  3)
#define  OTG_HS_GINTSTS_RXFLVL              ((uint32_t)    1U  <<  4)
#define  OTG_HS_GINTSTS_NPTXFE              ((uint32_t)    1U  <<  5)
#define  OTG_HS_GINTSTS_GINAKEFF            ((uint32_t)    1U  <<  6)
#define  OTG_HS_GINTSTS_GONAKEFF            ((uint32_t)    1U  <<  7)
#define  OTG_HS_GINTSTS_ESUSP               ((uint32_t)    1U  << 10)
#define  OTG_HS_GINTSTS_USBSUSP             ((uint32_t)    1U  << 11)
#define  OTG_HS_GINTSTS_USBRST              ((uint32_t)    1U  << 12)
#define  OTG_HS_GINTSTS_ENUMDNE             ((uint32_t)    1U  << 13)
#define  OTG_HS_GINTSTS_ISOODRP             ((uint32_t)    1U  << 14)
#define  OTG_HS_GINTSTS_EOPF                ((uint32_t)    1U  << 15)
#define  OTG_HS_GINTSTS_IEPINT              ((uint32_t)    1U  << 18)
#define  OTG_HS_GINTSTS_OEPINT              ((uint32_t)    1U  << 19)
#define  OTG_HS_GINTSTS_IISOIXFR            ((uint32_t)    1U  << 20)
#define  OTG_HS_GINTSTS_IPXFR               ((uint32_t)    1U  << 21)
#define  OTG_HS_GINTSTS_INCOMPISOOUT        ((uint32_t)    1U  << 21)
#define  OTG_HS_GINTSTS_DATAFSUSP           ((uint32_t)    1U  << 22)
#define  OTG_HS_GINTSTS_HPRTINT             ((uint32_t)    1U  << 24)
#define  OTG_HS_GINTSTS_HCINT               ((uint32_t)    1U  << 25)
#define  OTG_HS_GINTSTS_PTXFE               ((uint32_t)    1U  << 26)
#define  OTG_HS_GINTSTS_CIDSCHG             ((uint32_t)    1U  << 28)
#define  OTG_HS_GINTSTS_DISCINT             ((uint32_t)    1U  << 29)
#define  OTG_HS_GINTSTS_SRQINT              ((uint32_t)    1U  << 30)
#define  OTG_HS_GINTSTS_WKUPINT             ((uint32_t)    1U  << 31)

// OTG_HS interrupt mask register (OTG_HS_GINTMSK)
#define  OTG_HS_GINTMSK_MMISM               ((uint32_t)    1U  <<  1)
#define  OTG_HS_GINTMSK_OTGINT              ((uint32_t)    1U  <<  2)
#define  OTG_HS_GINTMSK_SOFM                ((uint32_t)    1U  <<  3)
#define  OTG_HS_GINTMSK_RXFLVLM             ((uint32_t)    1U  <<  4)
#define  OTG_HS_GINTMSK_NPTXFEM             ((uint32_t)    1U  <<  5)
#define  OTG_HS_GINTMSK_GINAKEFFM           ((uint32_t)    1U  <<  6)
#define  OTG_HS_GINTMSK_GONAKEFFM           ((uint32_t)    1U  <<  7)
#define  OTG_HS_GINTMSK_ESUSPM              ((uint32_t)    1U  << 10)
#define  OTG_HS_GINTMSK_USBSUSPM            ((uint32_t)    1U  << 11)
#define  OTG_HS_GINTMSK_USBRST              ((uint32_t)    1U  << 12)
#define  OTG_HS_GINTMSK_ENUMDNEM            ((uint32_t)    1U  << 13)
#define  OTG_HS_GINTMSK_ISOODRPM            ((uint32_t)    1U  << 14)
#define  OTG_HS_GINTMSK_EOPFM               ((uint32_t)    1U  << 15)
#define  OTG_HS_GINTMSK_EPMISM              ((uint32_t)    1U  << 17)
#define  OTG_HS_GINTMSK_IEPINT              ((uint32_t)    1U  << 18)
#define  OTG_HS_GINTMSK_OEPINT              ((uint32_t)    1U  << 19)
#define  OTG_HS_GINTMSK_IISOIXFRM           ((uint32_t)    1U  << 20)
#define  OTG_HS_GINTMSK_IPXFRM              ((uint32_t)    1U  << 21)
#define  OTG_HS_GINTMSK_IISOOXFRM           ((uint32_t)    1U  << 21)
#define  OTG_HS_GINTMSK_FSUSPM              ((uint32_t)    1U  << 22)
#define  OTG_HS_GINTMSK_PRTIM               ((uint32_t)    1U  << 24)
#define  OTG_HS_GINTMSK_HCIM                ((uint32_t)    1U  << 25)
#define  OTG_HS_GINTMSK_PTXFEM              ((uint32_t)    1U  << 26)
#define  OTG_HS_GINTMSK_CIDSCHGM            ((uint32_t)    1U  << 28)
#define  OTG_HS_GINTMSK_DISCINT             ((uint32_t)    1U  << 29)
#define  OTG_HS_GINTMSK_SRQIM               ((uint32_t)    1U  << 30)
#define  OTG_HS_GINTMSK_WUIM                ((uint32_t)    1U  << 31)

// OTG_HS status debug read register (OTG_HS_GRXSTSR)
#define  OTG_HS_GRXSTSR_CHNUM_POS           ((uint32_t)           0U)
#define  OTG_HS_GRXSTSR_CHNUM_MSK           ((uint32_t) 0x0FU       )
#define  OTG_HS_GRXSTSR_CHNUM(x)           (((uint32_t)    x        ) & OTG_HS_GRXSTSR_CHNUM_MSK)
#define  OTG_HS_GRXSTSR_EPNUM_POS           ((uint32_t)           0U)
#define  OTG_HS_GRXSTSR_EPNUM_MSK           ((uint32_t) 0x0FU       )
#define  OTG_HS_GRXSTSR_EPNUM(x)           (((uint32_t)    x        ) & OTG_HS_GRXSTSR_EPNUM_MSK)
#define  OTG_HS_GRXSTSR_BCNT_POS            ((uint32_t)           4U)
#define  OTG_HS_GRXSTSR_BCNT_MSK            ((uint32_t)0x7FFU  << OTG_HS_GRXSTSR_BCNT_POS)
#define  OTG_HS_GRXSTSR_BCNT(x)            (((uint32_t)    x   << OTG_HS_GRXSTSR_BCNT_POS) & OTG_HS_GRXSTSR_BCNT_MSK)
#define  OTG_HS_GRXSTSR_DPID_POS            ((uint32_t)           15U)
#define  OTG_HS_GRXSTSR_DPID_MSK            ((uint32_t)    3U  << OTG_HS_GRXSTSR_DPID_POS)
#define  OTG_HS_GRXSTSR_DPID(x)            (((uint32_t)    x   << OTG_HS_GRXSTSR_DPID_POS) & OTG_HS_GRXSTSR_DPID_MSK)
#define  OTG_HS_GRXSTSR_PKTSTS_POS          ((uint32_t)           17U)
#define  OTG_HS_GRXSTSR_PKTSTS_MSK          ((uint32_t) 0x0FU  << OTG_HS_GRXSTSR_PKTSTS_POS)
#define  OTG_HS_GRXSTSR_PKTSTS(x)          (((uint32_t)    x   << OTG_HS_GRXSTSR_PKTSTS_POS) & OTG_HS_GRXSTSR_PKTSTS_MSK)
#define  OTG_HS_GRXSTSR_FRMNUM_POS          ((uint32_t)           21U)
#define  OTG_HS_GRXSTSR_FRMNUM_MSK          ((uint32_t) 0x0FU  << OTG_HS_GRXSTSR_FRMNUM_POS)
#define  OTG_HS_GRXSTSR_FRMNUM(x)          (((uint32_t)    x   << OTG_HS_GRXSTSR_FRMNUM_POS) & OTG_HS_GRXSTSR_FRMNUM_MSK)

// OTG_HS status read and pop register (OTG_HS_GRXSTSP)
#define  OTG_HS_GRXSTSP_CHNUM_POS           ((uint32_t)           0U)
#define  OTG_HS_GRXSTSP_CHNUM_MSK           ((uint32_t) 0x0FU       )
#define  OTG_HS_GRXSTSP_CHNUM(x)           (((uint32_t)    x        ) & OTG_HS_GRXSTSP_CHNUM_MSK)
#define  OTG_HS_GRXSTSP_EPNUM_POS           ((uint32_t)           0U)
#define  OTG_HS_GRXSTSP_EPNUM_MSK           ((uint32_t) 0x0FU       )
#define  OTG_HS_GRXSTSP_EPNUM(x)           (((uint32_t)    x        ) & OTG_HS_GRXSTSP_EPNUM_MSK)
#define  OTG_HS_GRXSTSP_BCNT_POS            ((uint32_t)           4U)
#define  OTG_HS_GRXSTSP_BCNT_MSK            ((uint32_t)0x7FFU  << OTG_HS_GRXSTSP_BCNT_POS)
#define  OTG_HS_GRXSTSP_BCNT(x)            (((uint32_t)    x   << OTG_HS_GRXSTSP_BCNT_POS) & OTG_HS_GRXSTSP_BCNT_MSK)
#define  OTG_HS_GRXSTSP_DPID_POS            ((uint32_t)           15U)
#define  OTG_HS_GRXSTSP_DPID_MSK            ((uint32_t)    3U  << OTG_HS_GRXSTSP_DPID_POS)
#define  OTG_HS_GRXSTSP_DPID(x)            (((uint32_t)    x   << OTG_HS_GRXSTSP_DPID_POS) & OTG_HS_GRXSTSP_DPID_MSK)
#define  OTG_HS_GRXSTSP_PKTSTS_POS          ((uint32_t)           17U)
#define  OTG_HS_GRXSTSP_PKTSTS_MSK          ((uint32_t) 0x0FU  << OTG_HS_GRXSTSP_PKTSTS_POS)
#define  OTG_HS_GRXSTSP_PKTSTS(x)          (((uint32_t)    x   << OTG_HS_GRXSTSP_PKTSTS_POS) & OTG_HS_GRXSTSP_PKTSTS_MSK)
#define  OTG_HS_GRXSTSP_FRMNUM_POS          ((uint32_t)           21U)
#define  OTG_HS_GRXSTSP_FRMNUM_MSK          ((uint32_t) 0x0FU  << OTG_HS_GRXSTSP_FRMNUM_POS)
#define  OTG_HS_GRXSTSP_FRMNUM(x)          (((uint32_t)    x   << OTG_HS_GRXSTSP_FRMNUM_POS) & OTG_HS_GRXSTSP_FRMNUM_MSK)

// OTG_HS Receive FIFO size register (OTG_HS_GRXFSIZ)
#define  OTG_HS_GRXFSIZ_RXFD_POS            ((uint32_t)            0U)
#define  OTG_HS_GRXFSIZ_RXFD_MSK            ((uint32_t)0xFFFFU      )
#define  OTG_HS_GRXFSIZ_RXFD(x)            (((uint32_t)    x        ) & OTG_HS_GRXFSIZ_RXFD_MSK)

