Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_HS_STM32F4xx.h
// OTG_HS Host all channels interrupt mask register (OTG_HS_HAINTMSK)
#define  OTG_HS_HAINTMSK_HAINTM_POS         ((uint32_t)           0U)
#define  OTG_HS_HAINTMSK_HAINTM_MSK         ((uint32_t)0xFFFFU      )
#define  OTG_HS_HAINTMSK_HAINTM(x)         (((uint32_t)    x        ) & OTG_HS_HAINTMSK_HAINTM_MSK)

// OTG_HS Host port control and status register (OTG_HS_HPRT)
#define  OTG_HS_HPRT_PCSTS                  ((uint32_t)    1U       )
#define  OTG_HS_HPRT_PCDET                  ((uint32_t)    1U  <<  1)
#define  OTG_HS_HPRT_PENA                   ((uint32_t)    1U  <<  2)
#define  OTG_HS_HPRT_PENCHNG                ((uint32_t)    1U  <<  3)
#define  OTG_HS_HPRT_POCA                   ((uint32_t)    1U  <<  4)
#define  OTG_HS_HPRT_POCCHNG                ((uint32_t)    1U  <<  5)
#define  OTG_HS_HPRT_PRES                   ((uint32_t)    1U  <<  6)
#define  OTG_HS_HPRT_PSUSP                  ((uint32_t)    1U  <<  7)
#define  OTG_HS_HPRT_PRST                   ((uint32_t)    1U  <<  8)
#define  OTG_HS_HPRT_PLSTS_POS              ((uint32_t)           10U)
#define  OTG_HS_HPRT_PLSTS_MSK              ((uint32_t)    3U  << OTG_HS_HPRT_PLSTS_POS)
#define  OTG_HS_HPRT_PLSTS(x)              (((uint32_t)    x   << OTG_HS_HPRT_PLSTS_POS) & OTG_HS_HPRT_PLSTS_MSK)
#define  OTG_HS_HPRT_PPWR                   ((uint32_t)    1U  << 12)
#define  OTG_HS_HPRT_PTCTL_POS              ((uint32_t)           13U)
#define  OTG_HS_HPRT_PTCTL_MSK              ((uint32_t) 0x0FU  << OTG_HS_HPRT_PTCTL_POS)
#define  OTG_HS_HPRT_PTCTL(x)              (((uint32_t)    x   << OTG_HS_HPRT_PTCTL_POS) & OTG_HS_HPRT_PTCTL_MSK)
#define  OTG_HS_HPRT_PSPD_POS               ((uint32_t)           17U)
#define  OTG_HS_HPRT_PSPD_MSK               ((uint32_t)    3U  << OTG_HS_HPRT_PSPD_POS)
#define  OTG_HS_HPRT_PSPD(x)               (((uint32_t)    x   << OTG_HS_HPRT_PSPD_POS) & OTG_HS_HPRT_PSPD_MSK)

// OTG_HS Host channel-x characteristics register (OTG_HS_HCCHARx)
#define  OTG_HS_HCCHARx_MPSIZ_POS           ((uint32_t)           0U)
#define  OTG_HS_HCCHARx_MPSIZ_MSK           ((uint32_t)0x7FFU       )
#define  OTG_HS_HCCHARx_MPSIZ(x)           (((uint32_t)    x        ) & OTG_HS_HCCHARx_MPSIZ_MSK)
#define  OTG_HS_HCCHARx_EPNUM_POS           ((uint32_t)           11U)
#define  OTG_HS_HCCHARx_EPNUM_MSK           ((uint32_t) 0x0FU  << OTG_HS_HCCHARx_EPNUM_POS)
#define  OTG_HS_HCCHARx_EPNUM(x)           (((uint32_t)    x   << OTG_HS_HCCHARx_EPNUM_POS) & OTG_HS_HCCHARx_EPNUM_MSK)
#define  OTG_HS_HCCHARx_EPDIR               ((uint32_t)    1U  << 15)
#define  OTG_HS_HCCHARx_LSDEV               ((uint32_t)    1U  << 17)
#define  OTG_HS_HCCHARx_EPTYP_POS           ((uint32_t)           18U)
#define  OTG_HS_HCCHARx_EPTYP_MSK           ((uint32_t)    3U  << OTG_HS_HCCHARx_EPTYP_POS)
#define  OTG_HS_HCCHARx_EPTYP(x)           (((uint32_t)    x   << OTG_HS_HCCHARx_EPTYP_POS) & OTG_HS_HCCHARx_EPTYP_MSK)
#define  OTG_HS_HCCHARx_MCNT_POS            ((uint32_t)           20U)
#define  OTG_HS_HCCHARx_MCNT_MSK            ((uint32_t)    3U  << OTG_HS_HCCHARx_MCNT_POS)
#define  OTG_HS_HCCHARx_MCNT(x)            (((uint32_t)    x   << OTG_HS_HCCHARx_MCNT_POS) & OTG_HS_HCCHARx_MCNT_MSK)
#define  OTG_HS_HCCHARx_DAD_POS             ((uint32_t)           22U)
#define  OTG_HS_HCCHARx_DAD_MSK             ((uint32_t) 0x7FU  << OTG_HS_HCCHARx_DAD_POS)
#define  OTG_HS_HCCHARx_DAD(x)             (((uint32_t)    x   << OTG_HS_HCCHARx_DAD_POS) & OTG_HS_HCCHARx_DAD_MSK)
#define  OTG_HS_HCCHARx_ODDFRM              ((uint32_t)    1U  << 29)
#define  OTG_HS_HCCHARx_CHDIS               ((uint32_t)    1U  << 30)
#define  OTG_HS_HCCHARx_CHENA               ((uint32_t)    1U  << 31)

// OTG_HS Host channel-x split control register (OTG_HS_HCSPLTx)
#define  OTG_HS_HCSPLTx_PRTADDR_POS         ((uint32_t)           0U)
#define  OTG_HS_HCSPLTx_PRTADDR_MSK         ((uint32_t) 0x7FU       )
#define  OTG_HS_HCSPLTx_PRTADDR(x)         (((uint32_t)    x        ) & OTG_HS_HCSPLTx_PRTADDR_MSK)
#define  OTG_HS_HCSPLTx_HUBADDR_POS         ((uint32_t)           7U)
#define  OTG_HS_HCSPLTx_HUBADDR_MSK         ((uint32_t) 0x7FU  << OTG_HS_HCSPLTx_HUBADDR_POS)
#define  OTG_HS_HCSPLTx_HUBADDR(x)         (((uint32_t)    x   << OTG_HS_HCSPLTx_HUBADDR_POS) & OTG_HS_HCSPLTx_HUBADDR_MSK)
#define  OTG_HS_HCSPLTx_XACTPOS_POS         ((uint32_t)           14U)
#define  OTG_HS_HCSPLTx_XACTPOS_MSK         ((uint32_t)    3U  << OTG_HS_HCSPLTx_XACTPOS_POS)
#define  OTG_HS_HCSPLTx_XACTPOS(x)         (((uint32_t)    x   << OTG_HS_HCSPLTx_XACTPOS_POS) & OTG_HS_HCSPLTx_XACTPOS_MSK)
#define  OTG_HS_HCSPLTx_COMPLSPLT           ((uint32_t)    1U  << 16)
#define  OTG_HS_HCSPLTx_SPLITEN             ((uint32_t)    1U  << 31)

// OTG_HS Host channel-x interrupt register (OTG_HS_HCINTx)
#define  OTG_HS_HCINTx_XFRC                 ((uint32_t)    1U       )
#define  OTG_HS_HCINTx_CHH                  ((uint32_t)    1U  <<  1)
#define  OTG_HS_HCINTx_AHBERR               ((uint32_t)    1U  <<  2)
#define  OTG_HS_HCINTx_STALL                ((uint32_t)    1U  <<  3)
#define  OTG_HS_HCINTx_NAK                  ((uint32_t)    1U  <<  4)
#define  OTG_HS_HCINTx_ACK                  ((uint32_t)    1U  <<  5)
#define  OTG_HS_HCINTx_NYET                 ((uint32_t)    1U  <<  6)
#define  OTG_HS_HCINTx_TXERR                ((uint32_t)    1U  <<  7)
#define  OTG_HS_HCINTx_BBERR                ((uint32_t)    1U  <<  8)
#define  OTG_HS_HCINTx_FRMOR                ((uint32_t)    1U  <<  9)
#define  OTG_HS_HCINTx_DTERR                ((uint32_t)    1U  << 10)
#define  OTG_HS_HCINTx_ERR                  ((uint32_t) 0x0FU  <<  7)

// OTG_HS Host channel-x interrupt mask register (OTG_HS_HCINTMSKx)
#define  OTG_HS_HCINTMSKx_XFRCM             ((uint32_t)    1U       )
#define  OTG_HS_HCINTMSKx_CHHM              ((uint32_t)    1U  <<  1)
#define  OTG_HS_HCINTMSKx_AHBERR            ((uint32_t)    1U  <<  2)
#define  OTG_HS_HCINTMSKx_STALLM            ((uint32_t)    1U  <<  3)
#define  OTG_HS_HCINTMSKx_NAKM              ((uint32_t)    1U  <<  4)
#define  OTG_HS_HCINTMSKx_ACKM              ((uint32_t)    1U  <<  5)
#define  OTG_HS_HCINTMSKx_NYET              ((uint32_t)    1U  <<  6)
#define  OTG_HS_HCINTMSKx_TXERRM            ((uint32_t)    1U  <<  7)
#define  OTG_HS_HCINTMSKx_BBERRM            ((uint32_t)    1U  <<  8)
#define  OTG_HS_HCINTMSKx_FRMORM            ((uint32_t)    1U  <<  9)
#define  OTG_HS_HCINTMSKx_DTERRM            ((uint32_t)    1U  << 10)

// OTG_HS Host channel-x transfer size register (OTG_HS_HCTSIZx)
#define  OTG_HS_HCTSIZx_XFRSIZ_POS          ((uint32_t)           0U)
#define  OTG_HS_HCTSIZx_XFRSIZ_MSK          ((uint32_t)0x7FFFFU     )
#define  OTG_HS_HCTSIZx_XFRSIZ(x)          (((uint32_t)    x        ) & OTG_HS_HCTSIZx_XFRSIZ_MSK)
#define  OTG_HS_HCTSIZx_PKTCNT_POS          ((uint32_t)           19U)
#define  OTG_HS_HCTSIZx_PKTCNT_MSK          ((uint32_t)0x3FFU  << OTG_HS_HCTSIZx_PKTCNT_POS)
#define  OTG_HS_HCTSIZx_PKTCNT(x)          (((uint32_t)    x   << OTG_HS_HCTSIZx_PKTCNT_POS) & OTG_HS_HCTSIZx_PKTCNT_MSK)
#define  OTG_HS_HCTSIZx_DPID_POS            ((uint32_t)           29U)
#define  OTG_HS_HCTSIZx_DPID_MSK            ((uint32_t)    3U  << OTG_HS_HCTSIZx_DPID_POS)
#define  OTG_HS_HCTSIZx_DPID(x)            (((uint32_t)    x   << OTG_HS_HCTSIZx_DPID_POS) & OTG_HS_HCTSIZx_DPID_MSK)
#define  OTG_HS_HCTSIZx_DPID_DATA0          (OTG_HS_HCTSIZx_DPID(0U))
#define  OTG_HS_HCTSIZx_DPID_DATA2          (OTG_HS_HCTSIZx_DPID(1U))
#define  OTG_HS_HCTSIZx_DPID_DATA1          (OTG_HS_HCTSIZx_DPID(2U))
#define  OTG_HS_HCTSIZx_DPID_MDATA          (OTG_HS_HCTSIZx_DPID(3U))
#define  OTG_HS_HCTSIZx_DPID_SETUP          (OTG_HS_HCTSIZx_DPID(3U))
#define  OTG_HS_HCISIZx_DOPING              ((uint32_t)    1U  << 31)

// OTG_HS device configuration register (OTG_HS_DCFG)
#define  OTG_HS_DCFG_DSPD_POS               ((uint32_t)           0U)
#define  OTG_HS_DCFG_DSPD_MSK               ((uint32_t)    3U       )
#define  OTG_HS_DCFG_DSPD(x)               (((uint32_t)    x        ) & OTG_HS_DCFG_DSPD_MSK)
#define  OTG_HS_DCFG_NZLSOHSK               ((uint32_t)    1U  <<  2)
#define  OTG_HS_DCFG_DAD_POS                ((uint32_t)           4U)
#define  OTG_HS_DCFG_DAD_MSK                ((uint32_t) 0x7FU  << OTG_HS_DCFG_DAD_POS)
#define  OTG_HS_DCFG_DAD(x)                (((uint32_t)    x   << OTG_HS_DCFG_DAD_POS) & OTG_HS_DCFG_DAD_MSK)
#define  OTG_HS_DCFG_PFIVL_POS              ((uint32_t)           11U)
#define  OTG_HS_DCFG_PFIVL_MSK              ((uint32_t)    3U  << OTG_HS_DCFG_PFIVL_POS)
#define  OTG_HS_DCFG_PFIVL(x)              (((uint32_t)    x   << OTG_HS_DCFG_PFIVL_POS) & OTG_HS_DCFG_PFIVL_MSK)
#define  OTG_HS_DCFG_PERSCHIVL_POS          ((uint32_t)           24U)
#define  OTG_HS_DCFG_PERSCHIVL_MSK          ((uint32_t)    3U  << OTG_HS_DCFG_PERSCHIVL_POS)
#define  OTG_HS_DCFG_PERSCHIVL(x)          (((uint32_t)    x   << OTG_HS_DCFG_PERSCHIVL_POS) & OTG_HS_DCFG_PERSCHIVL_MSK)

// OTG_HS device control register (OTG_HS_DCTL)
#define  OTG_HS_DCTL_RWUSIG                 ((uint32_t)    1U       )
#define  OTG_HS_DCTL_SDIS                   ((uint32_t)    1U  <<  1)
#define  OTG_HS_DCTL_GINSTS                 ((uint32_t)    1U  <<  2)
#define  OTG_HS_DCTL_GONSTS                 ((uint32_t)    1U  <<  3)
#define  OTG_HS_DCTL_TCTL_POS               ((uint32_t)           4U)
#define  OTG_HS_DCTL_TCTL_MSK               ((uint32_t)    7U  << OTG_HS_DCTL_TCTL_POS)
#define  OTG_HS_DCTL_TCTL(x)               (((uint32_t)    x   << OTG_HS_DCTL_TCTL_POS) & OTG_HS_DCTL_TCTL_MSK)
#define  OTG_HS_DCTL_SGINAK                 ((uint32_t)    1U  <<  7)
#define  OTG_HS_DCTL_CGINAK                 ((uint32_t)    1U  <<  8)
#define  OTG_HS_DCTL_SGONAK                 ((uint32_t)    1U  <<  9)
#define  OTG_HS_DCTL_CGONAK                 ((uint32_t)    1U  << 10)
#define  OTG_HS_DCTL_POPRGDNE               ((uint32_t)    1U  << 11)

