Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_HS_STM32F4xx.h
// OTG_HS device status register (OTG_HS_DSTS)
#define  OTG_HS_DSTS_SUSPSTS                ((uint32_t)    1U       )
#define  OTG_HS_DSTS_ENUMSPD_POS            ((uint32_t)           1U)
#define  OTG_HS_DSTS_ENUMSPD_MSK            ((uint32_t)    3U  << OTG_HS_DSTS_ENUMSPD_POS)
#define  OTG_HS_DSTS_ENUMSPD(x)            (((uint32_t)    x   << OTG_HS_DSTS_ENUMSPD_POS) & OTG_HS_DSTS_ENUMSPD_MSK)
#define  OTG_HS_DSTS_EERR                   ((uint32_t)    1U  <<  3)
#define  OTG_HS_DSTS_FNSOF_POS              ((uint32_t)           8U)
#define  OTG_HS_DSTS_FNSOF_MSK              ((uint32_t)0x3FFFU << OTG_HS_DSTS_FNSOF_POS)
#define  OTG_HS_DSTS_FNSOF(x)              (((uint32_t)    x   << OTG_HS_DSTS_FNSOF_POS) & OTG_HS_DSTS_FNSOF_MSK)

// OTG_HS device IN endpoint common interrupt mask register (OTG_HS_DIEPMSK)
#define  OTG_HS_DIEPMSK_XFRCM               ((uint32_t)    1U       )
#define  OTG_HS_DIEPMSK_EPDM                ((uint32_t)    1U  <<  1)
#define  OTG_HS_DIEPMSK_TOM                 ((uint32_t)    1U  <<  3)
#define  OTG_HS_DIEPMSK_ITTXFEMSK           ((uint32_t)    1U  <<  4)
#define  OTG_HS_DIEPMSK_INEPNMM             ((uint32_t)    1U  <<  5)
#define  OTG_HS_DIEPMSK_INEPNEM             ((uint32_t)    1U  <<  6)
#define  OTG_HS_DIEPMSK_TXFURM              ((uint32_t)    1U  <<  8)
#define  OTG_HS_DIEPMSK_BIM                 ((uint32_t)    1U  <<  9)

// OTG_HS device OUT endpoint common interrupt mask register (OTG_HS_DOEPMSK)
#define  OTG_HS_DOEPMSK_XFRCM               ((uint32_t)    1U       )
#define  OTG_HS_DOEPMSK_EPDM                ((uint32_t)    1U  <<  1)
#define  OTG_HS_DOEPMSK_STUPM               ((uint32_t)    1U  <<  3)
#define  OTG_HS_DOEPMSK_OTEPDM              ((uint32_t)    1U  <<  4)
#define  OTG_HS_DOEPMSK_B2BSTUP             ((uint32_t)    1U  <<  6)
#define  OTG_HS_DOEPMSK_OPEM                ((uint32_t)    1U  <<  8)
#define  OTG_HS_DOEPMSK_BOIM                ((uint32_t)    1U  <<  9)

// OTG_HS device all endpoints interrupt register (OTG_HS_DAINT)
#define  OTG_HS_DAINT_IEPINT(in_ep)         ((uint32_t)((1U <<         in_ep)  & 0x0000FFFFU))
#define  OTG_HS_DAINT_OEPINT(out_ep)        ((uint32_t)((1U << (16U + out_ep)) & 0xFFFF0000U))

// OTG_HS device all endpoints interrupt mask register (OTG_HS_DAINTMSK)
#define  OTG_HS_DAINTMSK_IEPM(in_ep)        ((uint32_t)((1U <<         in_ep)  & 0x0000FFFFU))
#define  OTG_HS_DAINTMSK_OEPM(out_ep)       ((uint32_t)((1U << (16U + out_ep)) & 0xFFFF0000U))

// OTG_HS device Vbus discharge time register (OTG_HS_DVBUSDIS)
#define  OTG_HS_DVBUSDIS_VBUSDT_POS         ((uint32_t)           0U)
#define  OTG_HS_DVBUSDIS_VBUSDT_MSK         ((uint32_t)0xFFFFU      )
#define  OTG_HS_DVBUSDIS_VBUSDT(x)         (((uint32_t)    x        ) & OTG_HS_DVBUSDIS_VBUSDT_MSK)

// OTG_HS device Vbus pulsing time register (OTG_HS_DVBUSPULSE)
#define  OTG_HS_DVBUSPULSE_DVBUSP_POS       ((uint32_t)           0U)
#define  OTG_HS_DVBUSPULSE_DVBUSP_MSK       ((uint32_t)0xFFFU       )
#define  OTG_HS_DVBUSPULSE_DVBUSP(x)       (((uint32_t)    x        ) & OTG_HS_DVBUSPULSE_DVBUSP)

// OTG_HS Device threshold control register (OTG_HS_DTHRCTL)
#define  OTG_HS_DTHRCTL_NONISOTHREN         ((uint32_t)    1U       )
#define  OTG_HS_DTHRCTL_ISOTHREN            ((uint32_t)    1U  <<  1)
#define  OTG_HS_DTHRCTL_TXTHRLEN_POS        ((uint32_t)           2U)
#define  OTG_HS_DTHRCTL_TXTHRLEN_MSK        ((uint32_t)0x1FFU  << OTG_HS_DTHRCTL_TXTHRLEN_POS)
#define  OTG_HS_DTHRCTL_TXTHRLEN(x)        (((uint32_t)    x   << OTG_HS_DTHRCTL_TXTHRLEN_POS) & OTG_HS_DTHRCTL_TXTHRLEN_MSK)
#define  OTG_HS_DTHRCTL_RXTHREN             ((uint32_t)    1U  << 16)
#define  OTG_HS_DTHRCTL_RXTHRLEN_POS        ((uint32_t)           17U)
#define  OTG_HS_DTHRCTL_RXTHRLEN_MSK        ((uint32_t)0x1FFU  << OTG_HS_DTHRCTL_RXTHRLEN_POS)
#define  OTG_HS_DTHRCTL_RXTHRLEN(x)        (((uint32_t)    x   << OTG_HS_DTHRCTL_RXTHRLEN_POS) & OTG_HS_DTHRCTL_RXTHRLEN_MSK)
#define  OTG_HS_DTHRCTL_ARPEN               ((uint32_t)    1U  << 27)

// OTG_HS device IN endpoint FIFO emtpy interrupt mask register (OTG_HS_DIEPEMPMSK)
#define  OTG_HS_DIEPEMPMSK_INEPTXFEM_POS    ((uint32_t)           0U)
#define  OTG_HS_DIEPEMPMSK_INEPTXFEM_MSK    ((uint32_t)0xFFFFU      )
#define  OTG_HS_DIEPEMPMSK_INEPTXFEM(x)    (((uint32_t)    x        ) & OTG_HS_DIEPEMPMSK_INEPTXFEM_MSK)

// OTG_HS device each endpoint interrupt register (OTG_HS_DEACHINT)
#define  OTG_HS_DEACHINT_IEP1INT            ((uint32_t)    1U  <<  1)
#define  OTG_HS_DEACHINT_OEP1INT            ((uint32_t)    1U  << 17)

// OTG_HS device each endpoint interrupt register mask (OTG_HS_DEACHINTMSK)
#define  OTG_HS_DEACHINTMSK_IEP1INTM        ((uint32_t)    1U  <<  1)
#define  OTG_HS_DEACHINTMSK_OEP1INTM        ((uint32_t)    1U  << 17)

// OTG_HS device endpoint-x control register (OTG_HS_DIEPCTLx)
#define  OTG_HS_DIEPCTLx_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_HS_DIEPCTLx_MPSIZ_MSK          ((uint32_t)0x7FFU       )
#define  OTG_HS_DIEPCTLx_MPSIZ(x)          (((uint32_t)    x        ) & OTG_HS_DIEPCTLx_MPSIZ_MSK)
#define  OTG_HS_DIEPCTLx_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_HS_DIEPCTLx_EONUM_POS          ((uint32_t)           16U)
#define  OTG_HS_DIEPCTLx_EONUM              ((uint32_t)    1U  << OTG_HS_DIEPCTLx_EONUM_POS)
#define  OTG_HS_DIEPCTLx_DPID               ((uint32_t)    1U  << 16)
#define  OTG_HS_DIEPCTLx_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_HS_DIEPCTLx_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_HS_DIEPCTLx_EPTYP_MSK          ((uint32_t)    3U  << OTG_HS_DIEPCTLx_EPTYP_POS)
#define  OTG_HS_DIEPCTLx_EPTYP(x)          (((uint32_t)    x   << OTG_HS_DIEPCTLx_EPTYP_POS) & OTG_HS_DIEPCTLx_EPTYP_MSK)
#define  OTG_HS_DIEPCTLx_STALL              ((uint32_t)    1U  << 21)
#define  OTG_HS_DIEPCTLx_TXFNUM_POS         ((uint32_t)           22U)
#define  OTG_HS_DIEPCTLx_TXFNUM_MSK         ((uint32_t) 0x0FU  << OTG_HS_DIEPCTLx_TXFNUM_POS)
#define  OTG_HS_DIEPCTLx_TXFNUM(x)         (((uint32_t)    x   << OTG_HS_DIEPCTLx_TXFNUM_POS) & OTG_HS_DIEPCTLx_TXFNUM_MSK)
#define  OTG_HS_DIEPCTLx_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_HS_DIEPCTLx_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_HS_DIEPCTLx_SD0PID             ((uint32_t)    1U  << 28)
#define  OTG_HS_DIEPCTLx_SEVNFRM            ((uint32_t)    1U  << 28)
#define  OTG_HS_DIEPCTLx_SODDFRM            ((uint32_t)    1U  << 29)
#define  OTG_HS_DIEPCTLx_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_HS_DIEPCTLx_EPENA              ((uint32_t)    1U  << 31)

// OTG_HS device control OUT endpoint 0 control register (OTG_HS_DOEPCTL0)
#define  OTG_HS_DOEPCTL0_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_HS_DOEPCTL0_MPSIZ_MSK          ((uint32_t)    3U       )
#define  OTG_HS_DOEPCTL0_MPSIZ(x)          (((uint32_t)    x        ) & OTG_HS_DOEPCTL0_MPSIZ_MSK)
#define  OTG_HS_DOEPCTL0_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_HS_DOEPCTL0_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_HS_DOEPCTL0_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_HS_DOEPCTL0_EPTYP_MSK          ((uint32_t)    3U  << OTG_HS_DOEPCTL0_EPTYP_POS)
#define  OTG_HS_DOEPCTL0_EPTYP(x)          (((uint32_t)    x   << OTG_HS_DOEPCTL0_EPTYP_POS) & OTG_HS_DOEPCTL0_EPTYP_MSK)
#define  OTG_HS_DOEPCTL0_SNPM               ((uint32_t)    1U  << 20)
#define  OTG_HS_DOEPCTL0_STALL              ((uint32_t)    1U  << 21)
#define  OTG_HS_DOEPCTL0_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_HS_DOEPCTL0_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_HS_DOEPCTL0_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_HS_DOEPCTL0_EPENA              ((uint32_t)    1U  << 31)

// OTG_HS device endpoint-x control register (OTG_HS_DOEPCTLx)
#define  OTG_HS_DOEPCTLx_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_HS_DOEPCTLx_MPSIZ_MSK          ((uint32_t)0x7FFU       )
#define  OTG_HS_DOEPCTLx_MPSIZ(x)          (((uint32_t)    x        ) & OTG_HS_DOEPCTLx_MPSIZ_MSK)
#define  OTG_HS_DOEPCTLx_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_HS_DOEPCTLx_EONUM_POS          ((uint32_t)           16U)
#define  OTG_HS_DOEPCTLx_EONUM              ((uint32_t)    1U  << OTG_HS_DOEPCTLx_EONUM_POS)
#define  OTG_HS_DOEPCTLx_DPID               ((uint32_t)    1U  << 16)
#define  OTG_HS_DOEPCTLx_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_HS_DOEPCTLx_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_HS_DOEPCTLx_EPTYP_MSK          ((uint32_t)    3U  << OTG_HS_DOEPCTLx_EPTYP_POS)
#define  OTG_HS_DOEPCTLx_EPTYP(x)          (((uint32_t)    x   << OTG_HS_DOEPCTLx_EPTYP_POS) & OTG_HS_DOEPCTLx_EPTYP_MSK)
#define  OTG_HS_DOEPCTLx_SNPM               ((uint32_t)    1U  << 20)
#define  OTG_HS_DOEPCTLx_STALL              ((uint32_t)    1U  << 21)
#define  OTG_HS_DOEPCTLx_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_HS_DOEPCTLx_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_HS_DOEPCTLx_SD0PID             ((uint32_t)    1U  << 28)
#define  OTG_HS_DOEPCTLx_SEVNFRM            ((uint32_t)    1U  << 28)
#define  OTG_HS_DOEPCTLx_SODDFRM            ((uint32_t)    1U  << 29)
#define  OTG_HS_DOEPCTLx_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_HS_DOEPCTLx_EPENA              ((uint32_t)    1U  << 31)

// OTG_HS device endpoint-x interrupt register (OTG_HS_DIEPINTx)
#define  OTG_HS_DIEPINTx_XFCR               ((uint32_t)    1U       )
#define  OTG_HS_DIEPINTx_EPDISD             ((uint32_t)    1U  <<  1)
#define  OTG_HS_DIEPINTx_TOC                ((uint32_t)    1U  <<  3)
#define  OTG_HS_DIEPINTx_ITTXFE             ((uint32_t)    1U  <<  4)
#define  OTG_HS_DIEPINTx_INEPNE             ((uint32_t)    1U  <<  6)
#define  OTG_HS_DIEPINTx_TXFE               ((uint32_t)    1U  <<  7)
#define  OTG_HS_DIEPINTx_TXFIFOUDRN         ((uint32_t)    1U  <<  8)
#define  OTG_HS_DIEPINTx_BNA                ((uint32_t)    1U  <<  9)
#define  OTG_HS_DIEPINTx_PKTDRPSTS          ((uint32_t)    1U  << 11)
#define  OTG_HS_DIEPINTx_BERR               ((uint32_t)    1U  << 12)
#define  OTG_HS_DIEPINTx_NAK                ((uint32_t)    1U  << 13)

// OTG_HS device endpoint-x interrupt register (OTG_HS_DOEPINTx)
#define  OTG_HS_DOEPINTx_XFCR               ((uint32_t)    1U       )
#define  OTG_HS_DOEPINTx_EPDISD             ((uint32_t)    1U  <<  1)
#define  OTG_HS_DOEPINTx_STUP               ((uint32_t)    1U  <<  3)
#define  OTG_HS_DOEPINTx_OTEPDIS            ((uint32_t)    1U  <<  4)
#define  OTG_HS_DOEPINTx_B2BSTUP            ((uint32_t)    1U  <<  6)
#define  OTG_HS_DOEPINTx_NYET               ((uint32_t)    1U  << 14)

